from numpy import random as rdm
import  numpy as np
#随机数
x = rdm.rand(2, 3, 4) #两行三列随机数
#print(x)
# [[ 0.78502179  0.04493547  0.46095339]
#  [ 0.85707187  0.66761642  0.52761917]]

y, z = rdm.rand(2, 3)#将生成的两行分别付给y和z
# print(y)
# print(z)
# [ 0.37102448  0.76007652  0.93248879]
# [ 0.01899883  0.20073163  0.19145892]

x = rdm.randint(1, 10, size=(3, 5, 2, 3))
# print(x)
# [[[2 4]
#   [3 4]
#   [8 9]
#   [6 9]
#   [1 4]]
#
#  [[5 6]
#   [5 6]
#   [7 5]
#   [6 8]
#   [6 5]]
#
#  [[1 3]
#   [6 6]
#   [1 2]
#   [5 5]
#   [5 3]]]
#二分项
bi = rdm.binomial(10, 0.3, size=20)
# print(bi)

dt = np.dot([2j, 3j], [2j, 3j])
# print(dt)

a = [[1, 0], [0, 1]]
b = [[4, 1], [2, 2]]
dt = np.dot(a, b)
print(dt)
# [[4 1]
#  [2 2]]







